In [15]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_excel('EQ.xlsx') # читаем файл Excel (по умолчанию 1 лист !! или скрытый лист. Листы лучше всегда прописывать!)

In [38]:
df.head(5)

        дата время по Гринвичу  широта  долгота  Класс Unnamed: 5
0 2021-01-14        13:13:22.4   55.22   110.41   10.3        NaN
1 2021-01-15        17:29:55.4   55.22   110.43    9.3        NaN
2 2021-01-15        18:45:59.0   56.28   113.40   10.4        NaN
3 2021-01-15        22:29:47.3   54.88   111.72   11.0        NaN
4 2021-01-27        02:46:05.8   56.55   121.08    9.7        NaN

In [13]:
df2 = pd.read_excel('EQ.xlsx', sheet_name = 'Лист2') # читаем файл Excel (открываем другой лист)

In [37]:
df.head(5)

        дата время по Гринвичу  широта  долгота  Класс Unnamed: 5
0 2021-01-14        13:13:22.4   55.22   110.41   10.3        NaN
1 2021-01-15        17:29:55.4   55.22   110.43    9.3        NaN
2 2021-01-15        18:45:59.0   56.28   113.40   10.4        NaN
3 2021-01-15        22:29:47.3   54.88   111.72   11.0        NaN
4 2021-01-27        02:46:05.8   56.55   121.08    9.7        NaN

In [ ]:
# Если таблица начинается не с первой строки - необходимо добавлять header = 1,2,3...

In [19]:
# Пример открытия без header:

df3 = pd.read_excel('EQ.xlsx', sheet_name = 'Лист3') # заголовок идет в название столбца

In [39]:
df3.head(5)

,ЭТО ЗАГОЛОВОК ДЛЯ ВСЕЙ ТАБЛИЦЫ HEADER,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Дата и Время,Широта,Долгота,K,fm,"Интенсивность, баллы"
1,2023-01-18 22:02:24,52.94,106.95,9.8,,NaN
2,2023-01-20 04:01:51,56.12,113.74,9.6,,NaN
3,2023-01-20 13:08:59,51.06,99.97,11.2,,Иркутск 2б
4,2023-01-20 19:01:44,52.92,106.97,9.7,,NaN

In [21]:
# попробуем открыть с header = 1 (с какой строки начинается таблица)
df4 = pd.read_excel('EQ.xlsx', sheet_name = 'Лист3', header = 1)

In [40]:
df4.head(5)

         Дата и Время  Широта  Долгота     K  fm Интенсивность, баллы
0 2023-01-18 22:02:24   52.94   106.95   9.8                      NaN
1 2023-01-20 04:01:51   56.12   113.74   9.6                      NaN
2 2023-01-20 13:08:59   51.06    99.97  11.2               Иркутск 2б
3 2023-01-20 19:01:44   52.92   106.97   9.7                      NaN
4 2023-01-21 07:52:56   51.10    99.96  10.2                      NaN

# Если данных очень много в документе Excel

In [ ]:
# лучше применять такой подход если данных очень много (и они например продолжаются на листах)

In [23]:
file = pd.ExcelFile('D:\Magic\Git\!Pandas\EQ.xlsx')

In [24]:
df11 = pd.read_excel(file)

In [41]:
df11.head(5)

        дата время по Гринвичу  широта  долгота  Класс Unnamed: 5
0 2021-01-14        13:13:22.4   55.22   110.41   10.3        NaN
1 2021-01-15        17:29:55.4   55.22   110.43    9.3        NaN
2 2021-01-15        18:45:59.0   56.28   113.40   10.4        NaN
3 2021-01-15        22:29:47.3   54.88   111.72   11.0        NaN
4 2021-01-27        02:46:05.8   56.55   121.08    9.7        NaN

In [28]:
df22 = pd.read_excel(file, sheet_name = 2, header = 1)

In [42]:
df22.head(5)

         Дата и Время  Широта  Долгота     K  fm Интенсивность, баллы
0 2023-01-18 22:02:24   52.94   106.95   9.8                      NaN
1 2023-01-20 04:01:51   56.12   113.74   9.6                      NaN
2 2023-01-20 13:08:59   51.06    99.97  11.2               Иркутск 2б
3 2023-01-20 19:01:44   52.92   106.97   9.7                      NaN
4 2023-01-21 07:52:56   51.10    99.96  10.2                      NaN

# Сохранение DataFrame в Excel

In [32]:
df22.to_excel('D:\Magic\Git\!Pandas\df_to_excel.xlsx')

In [33]:
# убираем столбец с дефолтными индексами:
df22.to_excel('D:\Magic\Git\!Pandas\df_to_excel_2.xlsx', index = False)

In [35]:
# по дефолту название листа sheet_name = Sheet1, для того, чтобы кастомизировать:
df22.to_excel('D:\Magic\Git\!Pandas\df_to_excel_3.xlsx', index = False, sheet_name = 'Some_EQs')

In [45]:
# ЕСЛИ ЗАПИСЫВАТЬ В ОДИН ФАЙЛ ДАЖЕ ПОД РАЗНЫМИ ЛИСТАМИ - ПРОИСХОДИТ ПЕРЕЗАПИСЬ
writer = pd.ExcelWriter('D:\Magic\Git\!Pandas\df_to_excel_4.xlsx') # сохраняет объект writer (он не открывается Excel)

# а теперь через writer записываем листы:
df22.to_excel(writer, index = False, sheet_name = 'Some_EQs')
df11.to_excel(writer, index = False, sheet_name = 'Some_EQs_sheet_2')

# для сохранения НЕОБХОДИМО:
writer.save()

C:\Users\roman\AppData\Local\Temp\ipykernel_8204\3309918427.py:9: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()

# DATA BASES

In [1]:
pip install sqlite

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement sqlite (from versions: none)
ERROR: No matching distribution found for sqlite

[notice] A new release of pip is available: 23.0 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import sqlite3

In [5]:
con = sqlite3.connect('D:\Magic\Git\!Pandas\db.sqlite3')

In [9]:
con.execute('select * from towns_town')

In [10]:
cursor = con.execute('select * from towns_town')

In [11]:
cursor

In [12]:
row = cursor.fetchall()

In [13]:
row

[(33,
  'London',
  'Второй по величине город Европы. Столица Соединённого Королевства Великобритании и Северной Ирландии. Административно образует регион Англии Большой Лондон, разделённый на 32 самоуправляемых района и Сити.',
  8173900),
 (34,
  'Birnengem',
  'Город является центром региона Уэст-Мидлендс и вторым по населению городом Англии.',
  1028700),
 (35,
  'Lids',
  'Третий по величине город Великобритании. Название «Лидс» применяется как по отношению к историческому центру города, так и к более широкому образованию, которое включает в себя небольшие города Отли и Уэзерби.',
  751485),
 (36,
  'Sheffild',
  'Один из восьми региональных центров, образующих группу основных городов Англии. Население агломерации 640 720 человек.',
  551800),
 (37,
  'Bristol',
  'Город на юго-западе Англии. Известен своим культурным наследием, доками и прекрасными парками. Население города около 467 099 человек.',
  467099),
 (38,
  'Manchester',
  'Город в Северо-Западной Англии. Известен своей культурной, спортивной и экономической значимостью. Население города около 547 627 человек.',
  547627),
 (39,
  'Newcastle',
  'Город на северо-востоке Англии. Известен своими историческими зданиями, культурой и кулинарными традициями. Население города около 300 196 человек.',
  300196),
 (40,
  'Nottingham',
  'Город в Восточной Англии. Известен своей архитектурой, культурными мероприятиями и богатой историей. Население города около 330 000 человек.',
  330000),
 (41,
  'Southampton',
  'Город на юге Англии, расположенный на берегу реки Итон. Известен своими историческими достопримечательностями, портом и круизными лайнерами. Население города около 253 651 человек.',
  253651)]

In [17]:
df = pd.DataFrame(row)

In [18]:
df

    0            1                                                  2        3
0  33       London  Второй по величине город Европы. Столица Соеди...  8173900
1  34    Birnengem  Город является центром региона Уэст-Мидлендс и...  1028700
2  35         Lids  Третий по величине город Великобритании. Назва...   751485
3  36     Sheffild  Один из восьми региональных центров, образующи...   551800
4  37      Bristol  Город на юго-западе Англии. Известен своим кул...   467099
5  38   Manchester  Город в Северо-Западной Англии. Известен своей...   547627
6  39    Newcastle  Город на северо-востоке Англии. Известен своим...   300196
7  40   Nottingham  Город в Восточной Англии. Известен своей архит...   330000
8  41  Southampton  Город на юге Англии, расположенный на берегу р...   253651

In [19]:
# вытягиваем названия колонок
cursor.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('description', None, None, None, None, None, None),
 ('population', None, None, None, None, None, None))

In [20]:
df2 = pd.DataFrame(row, columns = [x[0] for x in cursor.description])

In [22]:
df2

,id,name,description,population
0,33,London,Второй по величине город Европы. Столица Соеди...,8173900
1,34,Birnengem,Город является центром региона Уэст-Мидлендс и...,1028700
2,35,Lids,Третий по величине город Великобритании. Назва...,751485
3,36,Sheffild,"Один из восьми региональных центров, образующи...",551800
4,37,Bristol,Город на юго-западе Англии. Известен своим кул...,467099
5,38,Manchester,Город в Северо-Западной Англии. Известен своей...,547627
6,39,Newcastle,Город на северо-востоке Англии. Известен своим...,300196
7,40,Nottingham,Город в Восточной Англии. Известен своей архит...,330000
8,41,Southampton,"Город на юге Англии, расположенный на берегу р...",253651

In [25]:
# все манипуляции, проделанные выше выполняются проще с sqlalchemy
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\roman\appdata\local\programs\python\python310\lib\site-packages (2.0.11)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\roman\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\roman\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (4.5.0)

[notice] A new release of pip is available: 23.0 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [36]:
import sqlalchemy as sql

In [48]:
conn = sql.create_engine('sqlite:///D:\Magic\Git\!Pandas\db.sqlite3')

In [51]:
df33 = pd.read_sql('select * from town', conn)

AttributeError: 'OptionEngine' object has no attribute 'execute'

In [44]:
df33

NameError: name 'df33' is not defined